Revit 2027 API
FabricSheet.FabricNumber Property
 Specifies the numerical parameter assigned to the fabric sheet and any sheet of the same type, dimension, material, shape, and partition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FabricNumber { get; }
Public ReadOnly Property FabricNumber As String
	Get
public:
property String^ FabricNumber {
	String^ get ();
}
member FabricNumber : string with get
Property Value
String
Remarks
 Value of this property corresponds to the Fabric Number parameter of Rebar as available in both the UI and API. Refer to the [!:NumberingSchema] class for details related to numbering Rebar and Fabrics.
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace